---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.DisableAnalyticalModelCB
source: html/7fd220da-0ad7-8392-1055-f9811e988888.htm
---
# DisableAnalyticalModelCB Members

Specifies whether the .NET object represents a valid Revit entity.